In [1]:
from __future__ import division, print_function, unicode_literals
from numpy import *
import numpy as np
import matplotlib.pyplot as mplot
import matplotlib.pylab as plt
import matplotlib.cm as cm
import pandas as pd
import scipy.stats as stats
import pylab
import warnings
warnings.filterwarnings('ignore')

In [2]:
rainfall = pd.read_csv('rainfall.csv')
rainfall.head()

,SUBDIVISION,YEAR,Parameter,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL
0,ANDAMAN & NICOBAR ISLANDS,2000.0,Actual,53.0,59.0,171.3,218.1,422.8,357.0,176.3,460.8,250.1,321.2,158.3,115.2,2763.2
1,VIDARBHA,2000.0,Actual,0.1,16.4,0.1,0.1,28.8,235.9,472.1,286.2,54.0,11.0,0.0,0.5,1105.2
2,JHARKHAND,2000.0,Actual,3.6,21.2,6.3,19.6,67.7,185.3,358.4,152.8,356.9,19.1,0.4,0.2,1191.5
3,PUNJAB,2000.0,Actual,25.4,26.6,6.9,1.3,15.3,50.1,164.8,70.0,42.0,0.0,0.7,2.2,405.3
4,GANGETIC WEST BENGAL,2000.0,Actual,9.5,57.9,3.8,54.0,215.0,205.6,341.5,178.4,428.4,76.2,1.6,0.1,1572.1

In [47]:
# rainfall.loc[rainfall.loc[:,'SUBDIVISION'] ,'SUBDIVISION'] = 
# rainfall.loc[:,'SUBDIVISION']
# np.flatnonzero(np.core.defchararray.find(rainfall.loc[:,'SUBDIVISION'],'WEST BENGAL')!=-1)
set(rainfall1.loc[:,'SUBDIVISION'])

{'ANDAMAN & NICOBAR ISLANDS',
 'ARUNACHAL PRADESH',
 'ASSAM',
 'BIHAR',
 'CHHATTISGARH',
 'COASTAL ANDHRA PRADESH',
 'COASTAL KARNATAKA',
 'EAST MADHYA PRADESH',
 'EAST RAJASTHAN',
 'EAST UTTAR PRADESH',
 'GUJARAT REGION',
 'HARYANA DELHI & CHANDIGARH',
 'HIMACHAL PRADESH',
 'JAMMU & KASHMIR',
 'JHARKHAND',
 'KERALA',
 'KONKAN & GOA',
 'LAKSHADWEEP',
 'MADHYA MAHARASHTRA',
 'MATATHWADA',
 'NAGA MANI MIZO TRIPURA',
 'NORTH INTERIOR KARNATAKA',
 'ORISSA',
 'PUNJAB',
 'RAYALSEEMA',
 'SAURASHTRA & KUTCH',
 'SOUTH INTERIOR KARNATAKA',
 'TAMIL NADU',
 'TELANGANA',
 'UTTARAKHAND',
 'VIDARBHA',
 'WEST BENGAL',
 'WEST MADHYA PRADESH',
 'WEST RAJASTHAN',
 'WEST UTTAR PRADESH'}

In [290]:
rainfall1 = rainfall.copy()
rainfall1.YEAR=rainfall1.YEAR.astype(int)
rainfall1['SUBDIVISION']=rainfall1['SUBDIVISION'].astype(str)
rainfall1.loc[[ 'MEGHALAYA' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='MEGHALAYA'
rainfall1.loc[[ 'ASSAM' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='ASSAM'
rainfall1.loc[[ 'WEST BENGAL' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='WEST BENGAL'
rainfall1.loc[[ 'MADHYA PRADESH' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='MADHYA PRADESH'
rainfall1.loc[[ 'ANDHRA PRADESH' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='ANDHRA PRADESH'
rainfall1.loc[[ 'RAJASTHAN' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='RAJASTHAN'
rainfall1.loc[[ 'KARNATAKA' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='KARNATAKA'
rainfall1.loc[[ 'UTTAR PRADESH' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='UTTAR PRADESH'
rainfall1.loc[[ 'GUJARAT' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='GUJARAT'
rainfall1.loc[[ 'HARYANA' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='HARYANA'
rainfall1.loc[[ 'GOA' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='GOA'
rainfall1.loc[[ 'MAHARASHTRA' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='MAHARASHTRA'
rainfall1.loc[[ 'MATATHWADA' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='MAHARASHTRA'
rainfall1.loc[[ 'KUTCH' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='GUJARAT'
rainfall1.loc[[ 'RAYALSEEMA' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='ANDHRA PRADESH'
rainfall1.loc[[ 'VIDARBHA' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='MAHARASHTRA'
rainfall1.loc[[ 'TRIPURA' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='TRIPURA'
# rainfall1.loc[[ 'KUTCH' in i for i in rainfall1['SUBDIVISION']],'SUBDIVISION']='GUJARAT'
# print(len(set(rainfall1.loc[:,'SUBDIVISION']))*16)
rainfall1.rename(columns={'SUBDIVISION':'STATES'},inplace=True)
rainfall1.head()

,STATES,YEAR,Parameter,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL
0,ANDAMAN & NICOBAR ISLANDS,2000,Actual,53.0,59.0,171.3,218.1,422.8,357.0,176.3,460.8,250.1,321.2,158.3,115.2,2763.2
1,MAHARASHTRA,2000,Actual,0.1,16.4,0.1,0.1,28.8,235.9,472.1,286.2,54.0,11.0,0.0,0.5,1105.2
2,JHARKHAND,2000,Actual,3.6,21.2,6.3,19.6,67.7,185.3,358.4,152.8,356.9,19.1,0.4,0.2,1191.5
3,PUNJAB,2000,Actual,25.4,26.6,6.9,1.3,15.3,50.1,164.8,70.0,42.0,0.0,0.7,2.2,405.3
4,WEST BENGAL,2000,Actual,9.5,57.9,3.8,54.0,215.0,205.6,341.5,178.4,428.4,76.2,1.6,0.1,1572.1

In [291]:
print(rainfall1.shape)
states = rainfall1.loc[:,'STATES'].unique()
rainfall1 = rainfall1.groupby(['STATES','YEAR'],as_index=False).mean()
print(rainfall1.shape,states)
rainfall1.head()

(576, 16)
(416, 15) ['ANDAMAN & NICOBAR ISLANDS' 'MAHARASHTRA' 'JHARKHAND' 'PUNJAB'
 'WEST BENGAL' 'KARNATAKA' 'ANDHRA PRADESH' 'TAMIL NADU'
 'HIMACHAL PRADESH' 'MADHYA PRADESH' 'CHHATTISGARH' 'KERALA' 'LAKSHADWEEP'
 'RAJASTHAN' 'GUJARAT' 'HARYANA' 'ARUNACHAL PRADESH' 'UTTARAKHAND'
 'TRIPURA' 'UTTAR PRADESH' 'ORISSA' 'BIHAR' 'TELANGANA' 'JAMMU & KASHMIR'
 'MEGHALAYA' 'GOA']

,STATES,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL
0,ANDAMAN & NICOBAR ISLANDS,2000,53.0,59.0,171.3,218.1,422.8,357.0,176.3,460.8,250.1,321.2,158.3,115.2,2763.2
1,ANDAMAN & NICOBAR ISLANDS,2001,89.0,15.7,143.3,30.1,705.3,370.7,341.3,469.0,334.4,267.6,222.6,91.8,3080.9
2,ANDAMAN & NICOBAR ISLANDS,2002,10.6,0.0,11.5,100.2,366.7,358.3,317.4,429.8,420.0,169.0,306.7,129.9,2620.2
3,ANDAMAN & NICOBAR ISLANDS,2003,44.3,7.9,149.2,19.4,296.3,159.9,494.9,379.4,371.9,310.4,74.1,48.0,2355.9
4,ANDAMAN & NICOBAR ISLANDS,2004,54.5,35.9,36.5,41.6,505.1,423.9,378.9,308.7,280.7,223.9,169.9,0.4,2460.1

In [292]:
# rainfall1.drop(columns='Parameter',inplace=True)
# raingall1 = rainfall1.iloc[:,12].unstack(level=-1).reset_index()
rainfall1.to_csv('rainfall_cleaned.csv',sep=',',index=False)
rainfall1.head()

,STATES,YEAR,JAN,FEB,MAR,APR,MAY,JUN,JUL,AUG,SEP,OCT,NOV,DEC,ANNUAL
0,ANDAMAN & NICOBAR ISLANDS,2000,53.0,59.0,171.3,218.1,422.8,357.0,176.3,460.8,250.1,321.2,158.3,115.2,2763.2
1,ANDAMAN & NICOBAR ISLANDS,2001,89.0,15.7,143.3,30.1,705.3,370.7,341.3,469.0,334.4,267.6,222.6,91.8,3080.9
2,ANDAMAN & NICOBAR ISLANDS,2002,10.6,0.0,11.5,100.2,366.7,358.3,317.4,429.8,420.0,169.0,306.7,129.9,2620.2
3,ANDAMAN & NICOBAR ISLANDS,2003,44.3,7.9,149.2,19.4,296.3,159.9,494.9,379.4,371.9,310.4,74.1,48.0,2355.9
4,ANDAMAN & NICOBAR ISLANDS,2004,54.5,35.9,36.5,41.6,505.1,423.9,378.9,308.7,280.7,223.9,169.9,0.4,2460.1

In [286]:
rainfall1.iloc[:,12].unstack(level=-1).reset_index()

YEAR,STATES,2000,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015
0,ANDAMAN & NICOBAR ISLANDS,2763.2,3080.9,2620.2,2355.90,2460.10,2954.7,2404.70,2748.0,3374.80,2538.60,3157.10,3828.00,3497.6,3757.80,2622.40,2904.6
1,ANDHRA PRADESH,931.8,966.9,659.2,911.15,807.65,1144.0,898.85,1039.9,952.75,739.35,1337.95,799.95,1016.7,941.55,713.35,1029.0
2,ARUNACHAL PRADESH,2596.8,2036.0,2389.2,2451.80,2545.70,2335.5,2259.60,3020.7,2244.40,1749.90,2855.70,2193.70,3440.3,2042.90,2403.20,2767.5
3,BIHAR,1207.0,1247.0,1105.8,1353.90,1147.80,907.8,1052.80,1600.2,1197.70,889.30,629.20,1097.10,1032.4,1069.90,1061.00,872.7
4,CHHATTISGARH,906.3,1600.1,990.2,1694.30,1144.50,1287.2,1317.70,1281.2,1108.50,956.60,1306.60,1302.70,1377.4,1420.00,1278.70,1117.6

In [396]:
crop_prod=pd.read_csv('apy.csv',delimiter=',')
crop_prod=crop_prod.fillna(0)
crop_prod.drop(columns={'District_Name','Season' },inplace=True)
crop_prod.head()

,State_Name,Crop_Year,Crop,Area,Production
0,Andaman and Nicobar Islands,2000,Arecanut,1254.0,2000.0
1,Andaman and Nicobar Islands,2000,Other Kharif pulses,2.0,1.0
2,Andaman and Nicobar Islands,2000,Rice,102.0,321.0
3,Andaman and Nicobar Islands,2000,Banana,176.0,641.0
4,Andaman and Nicobar Islands,2000,Cashewnut,720.0,165.0

In [408]:
# crop_prod.State_Name.unique()
temp = crop_prod.copy()
temp = temp.loc[temp.loc[:,'Crop_Year'] >=2000,:]
temp = temp.groupby(['State_Name','Crop_Year','Crop'],as_index=True,sort=False).mean()
temp = temp.iloc[:,:].unstack(level=-1).reset_index()
temp = temp.fillna(0)
# temp.columns = temp.columns.droplevel()
# temp.rename(columns = {'' : 'STATES','' : 'YEAR'},inplace = True)
# area = temp.iloc[:,:17].head()
# area.head()
temp.head()

                       State_Name Crop_Year      Area                      \
Crop                                         Arecanut Other Kharif pulses
0     Andaman and Nicobar Islands      2000  2177.000               335.0
1     Andaman and Nicobar Islands      2001  2177.000               210.0
2     Andaman and Nicobar Islands      2002  2181.500                 0.0
3     Andaman and Nicobar Islands      2003  2189.500                 0.0
4     Andaman and Nicobar Islands      2004  2212.685                 0.0

                                                                 \
Crop      Rice  Banana Cashewnut  Coconut  Dry ginger Sugarcane
0     5440.500  853.50    400.00  12580.00     194.00     71.00
1     4900.500    0.00    400.00  12602.50     195.00     41.00
2     5442.500  868.50    400.00  12650.00     199.65    230.00
3     5280.685  898.00    416.75  12697.37     254.00    268.00
4     5367.460  989.26    400.00  12775.70     264.00    145.26

           ...       Production                                     \
Crop       ...              Yam Apple Peach Pear Plums Litchi  Ber
0          ...              0.0   0.0   0.0  0.0   0.0    0.0  0.0
1          ...              0.0   0.0   0.0  0.0   0.0    0.0  0.0
2          ...              0.0   0.0   0.0  0.0   0.0    0.0  0.0
3          ...              0.0   0.0   0.0  0.0   0.0    0.0  0.0
4          ...              0.0   0.0   0.0  0.0   0.0    0.0  0.0


Crop Other Dry Fruit Jute & mesta Total foodgrain
0                0.0          0.0             0.0
1                0.0          0.0             0.0
2                0.0          0.0             0.0
3                0.0          0.0             0.0
4                0.0          0.0             0.0

[5 rows x 248 columns]

In [402]:
production = pd.concat([temp.iloc[:,0],temp.iloc[:,17:]],axis=1)
production.head()

,STATES,Moong(Green Gram),Urad,Arhar/Tur,Groundnut,Sunflower,Bajra,Castor seed,Cotton(lint),Gram,...,Yam,Apple,Peach,Pear,Plums,Litchi,Ber,Other Dry Fruit,Jute & mesta,Total foodgrain
0,Andaman and Nicobar Islands,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
1,Andaman and Nicobar Islands,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
2,Andaman and Nicobar Islands,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
3,Andaman and Nicobar Islands,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
4,Andaman and Nicobar Islands,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0

In [415]:
growth = pd.read_csv('Avg annual Growth Rate_Major Crops.csv',delimiter = ',')
growth = pd.concat([growth.iloc[:,0],growth.iloc[:,5:]],axis=1,sort=False)
growth.fillna(0)
growth.head()

,Crop,(Ninth Plan) 1997-98 to 2001-02,(Tenth Plan) 2002-03 to 2006-07,(Eleventh Plan) 2007-08 to 2011-12
0,Wheat,0.7,-0.3,3.0
1,Rice,2.1,1.2,2.2
2,Jowar,0.2,2.1,3.1
3,Bajra,4.9,7.3,8.4
4,Maize,3.1,-0.2,6.5

In [418]:
avg_wage = pd.read_csv('avg_daily_wage_rate_plant_protection.csv',delimiter = ',')
avg_wage.fillna(0,inplace=True)
avg_wage.head()

,Particulars,States,Gender,11-2013,12-2013,1-2014,2-2014
0,Plant Protection - Pesticides and Treating Seeds,Andhra Pradesh,Men,295.29,323.07,331.18,323.48
1,Plant Protection - Pesticides and Treating Seeds,Assam,Men,225.33,0.00,0.00,0.00
2,Plant Protection - Pesticides and Treating Seeds,Bihar,Men,255.36,233.50,235.00,232.95
3,Plant Protection - Pesticides and Treating Seeds,Gujarat,Men,127.14,155.00,150.91,150.91
4,Plant Protection - Pesticides and Treating Seeds,Haryana,Men,323.33,323.33,323.33,323.33